CREATE SCHEMA IF NOT EXISTS ACCOUNT;

show search_path;

set search_path = 'ACCOUNT, PUBLIC';

-- Таблица Товар
CREATE TABLE IF NOT EXISTS Товар (
                   id SERIAL PRIMARY KEY,
                   описание TEXT NOT NULL,
                   стоимость DECIMAL NOT NULL,
                   количество INT NOT NULL
);

-- Таблица Покупатель
CREATE TABLE IF NOT EXISTS Покупатель (
                  id SERIAL PRIMARY KEY,
                  имя_фамилия TEXT NOT NULL
);

-- Таблица Заказ
CREATE TABLE IF NOT EXISTS Заказ (
                 id_товара INT REFERENCES Товар(id),
                 id_заказчика INT REFERENCES Покупатель(id),
                 дата_заказа DATE NOT NULL,
                 количество_товаров INT NOT NULL
);


-- Заполнение таблицы Товар
INSERT INTO Товар (описание, стоимость, количество) VALUES
                ('Телефон Samsung', 100.00, 10),
                ('Телефон Apple', 200.00, 20),
                ('Телефон Xiaomi', 300.00, 30),
                ('Телефон Huawei', 400.00, 40),
                ('Телефон Nokia', 500.00, 50),
                ('Телефон Sony', 600.00, 60),
                ('Телефон LG', 700.00, 70),
                ('Телефон Motorola', 800.00, 80),
                ('Телефон OnePlus', 900.00, 90),
                ('Телефон Google', 1000.00, 100);

-- Заполнение таблицы Покупатель
INSERT INTO Покупатель (имя_фамилия) VALUES
               ('Иванов Иван'),
               ('Петров Петр'),
               ('Сидоров Сидор'),
               ('Васильев Василий'),
               ('Алексеев Алексей'),
               ('Сергеев Сергей'),
               ('Андреев Андрей'),
               ('Антонов Антон'),
               ('Александров Александр'),
               ('Михайлов Михаил');

-- Заполнение таблицы Заказ
INSERT INTO Заказ (id_товара, id_заказчика, дата_заказа, количество_товаров) VALUES
              (1, 1, '2024-02-18', 2),
              (2, 2, '2024-02-19', 3),
              (3, 3, '2024-02-20', 4),
              (4, 4, '2024-02-21', 5),
              (5, 5, '2024-02-22', 6),
              (6, 6, '2024-02-23', 7),
              (7, 7, '2024-02-24', 8),
              (8, 8, '2024-02-25', 9),
              (9, 9, '2024-02-26', 10),
              (10, 10, '2024-02-27', 1);
