
-- Чтение данных
SELECT * FROM "Товар";
SELECT * FROM "Покупатель";
SELECT * FROM "Заказ";

-- Чтение данных с условием
SELECT * FROM "Товар" WHERE стоимость  < 500.00;
SELECT * FROM "Покупатель" WHERE имя_фамилия LIKE 'Иван Иванов';
SELECT * FROM "Заказ" WHERE дата_заказа < '2024-02-21';

-- Изменение данных
UPDATE "Товар" SET стоимость = 150.00 WHERE id = 1;
UPDATE "Покупатель" SET имя_фамилия = 'Новый Покупатель' WHERE id = 2;
UPDATE "Заказ" SET количество_товаров = 5 WHERE id_товара = 1 AND id_заказчика = 1;

-- Изменение данных с условием
UPDATE "Товар" SET стоимость = стоимость * 1.1 WHERE стоимость < 500.00;
UPDATE "Покупатель" SET имя_фамилия = CONCAT(имя_фамилия, ' Jr.') WHERE имя_фамилия LIKE 'Иванов%';
UPDATE "Заказ" SET количество_товаров = количество_товаров + 1 WHERE дата_заказа > '2024-02-20';

-- Удаление данных
DELETE FROM "Товар" WHERE id = 2;
DELETE FROM "Покупатель" WHERE id = 2;
DELETE FROM "Заказ" WHERE id_товара = 2 AND id_заказчика = 2;

-- Удаление данных с условием
DELETE FROM "Товар" WHERE стоимость < 100.00;
DELETE FROM "Покупатель" WHERE имя_фамилия LIKE 'Иванов%';
DELETE FROM "Заказ" WHERE дата_заказа < '2024-02-20';